Repository: pypi-data/pypi-mirror-284
Catalog: packages/Py-Lav/py_lav-1.15.14.tar.gz/py_lav-1.15.14/pylav/helpers/discord/converters/locales/*.po
Languages: fr_fr, zh_cn

source: Node with name or identifier `{user_input_variable_do_not_translate}` not found.
fr_fr: Nœud avec nom ou identificateur '{user_input_variable_do_not_translate}' introuvable.
zh_cn: 具有名称或标识符的节点 '{user_input_variable_do_not_translate}'未找到。

source: Node with name or identifier `{user_input_variable_do_not_translate}` not found
fr_fr: Nœud avec nom ou identificateur '{user_input_variable_do_not_translate}' introuvable
zh_cn: 具有名称或标识符的节点 '{user_input_variable_do_not_translate}' 未找到

source: A playlist with the name or identifier `{user_input_variable_do_not_translate}` was not found.
fr_fr: Une playlist avec le nom ou l’identifiant '{user_input_variable_do_not_translate}' n’a pas été trouvé.
zh_cn: 具有名称或标识符的播放列表”{user_input_variable_do_not_translate}'未找到。

source: The query must be a playlist or album.
fr_fr: La requête doit être une playlist ou un album.
zh_cn: 查询必须是播放列表或唱片集。

source: A station with the name `{user_input_variable_do_not_translate}` was not found.
fr_fr: Une station portant le nom '{user_input_variable_do_not_translate}' n’a pas été trouvé.
zh_cn: 名为”{user_input_variable_do_not_translate}'未找到。

source: The Radio Browser extension is currently disabled.
fr_fr: L’extension Radio Browser est actuellement désactivée.
zh_cn: 无线电浏览器扩展当前已禁用。

source: Unnamed
fr_fr: Sans nom
zh_cn: 无名

source: A tag with the name `{user_input_variable_do_not_translate}` was not found.
fr_fr: Une balise portant le nom '{user_input_variable_do_not_translate}' n’a pas été trouvé.
zh_cn: 名称为 “ 的标记{user_input_variable_do_not_translate}'未找到。

source: A language with the name `{user_input_variable_do_not_translate}` was not found.
fr_fr: Une langue portant le nom '{user_input_variable_do_not_translate}' n’a pas été trouvé.
zh_cn: 名称为 ”{user_input_variable_do_not_translate}'未找到。

source: A state with the name `{user_input_variable_do_not_translate}` was not found.
fr_fr: Un État portant le nom '{user_input_variable_do_not_translate}' n’a pas été trouvé.
zh_cn: 名称为 “ 的州{user_input_variable_do_not_translate}'未找到。

source: A codec with the name `{user_input_variable_do_not_translate}` was not found.
fr_fr: Un codec portant le nom '{user_input_variable_do_not_translate}' n’a pas été trouvé.
zh_cn: 名称为 “ 的编解码器{user_input_variable_do_not_translate}'未找到。

source: A country code with the value `{user_input_variable_do_not_translate}` was not found.
fr_fr: Un code de pays avec la valeur '{user_input_variable_do_not_translate}' n’a pas été trouvé.
zh_cn: 值为 ' 的国家/地区代码{user_input_variable_do_not_translate}'未找到。

source: A country with the name `{user_input_variable_do_not_translate}` was not found.
fr_fr: Un pays portant le nom de '{user_input_variable_do_not_translate}' n’a pas été trouvé.
zh_cn: 一个名字为”{user_input_variable_do_not_translate}'未找到。
