Repository: pypi-data/pypi-mirror-284
Catalog: packages/Py-Lav/py_lav-1.15.14-py3-none-any.whl/pylav/helpers/discord/converters/locales/*.po
Languages: de_de, hr_hr

source: Node with name or identifier `{user_input_variable_do_not_translate}` not found.
de_de: Knoten mit Name oder Bezeichner '{user_input_variable_do_not_translate}' nicht gefunden.
hr_hr: Čvor s nazivom ili identifikatorom '{user_input_variable_do_not_translate}' nije pronađeno.

source: Node with name or identifier `{user_input_variable_do_not_translate}` not found
de_de: Knoten mit Name oder Bezeichner '{user_input_variable_do_not_translate}' nicht gefunden
hr_hr: Čvor s nazivom ili identifikatorom '{user_input_variable_do_not_translate}' nije pronađeno

source: A playlist with the name or identifier `{user_input_variable_do_not_translate}` was not found.
de_de: Eine Wiedergabeliste mit dem Namen oder Bezeichner '{user_input_variable_do_not_translate}' wurde nicht gefunden.
hr_hr: Popis za reproduciranje s nazivom ili identifikatorom '{user_input_variable_do_not_translate}' nije pronađen.

source: The query must be a playlist or album.
de_de: Bei der Abfrage muss es sich um eine Wiedergabeliste oder ein Album handeln.
hr_hr: Upit mora biti popis za reproduciranje ili album.

source: A station with the name `{user_input_variable_do_not_translate}` was not found.
de_de: Eine Station mit dem Namen '{user_input_variable_do_not_translate}' wurde nicht gefunden.
hr_hr: Stanica s imenom '{user_input_variable_do_not_translate}' nije pronađen.

source: The Radio Browser extension is currently disabled.
de_de: Die Radiobrowser-Erweiterung ist derzeit deaktiviert.
hr_hr: Proširenje radijskog preglednika trenutno je onemogućeno.

source: Unnamed
de_de: Unbenannt
hr_hr: Neimenovan

source: A tag with the name `{user_input_variable_do_not_translate}` was not found.
de_de: Ein Tag mit dem Namen '{user_input_variable_do_not_translate}' wurde nicht gefunden.
hr_hr: Oznaka s nazivom '{user_input_variable_do_not_translate}' nije pronađen.

source: A language with the name `{user_input_variable_do_not_translate}` was not found.
de_de: eine Sprache mit dem Namen '{user_input_variable_do_not_translate}' wurde nicht gefunden.
hr_hr: Jezik s nazivom '{user_input_variable_do_not_translate}' nije pronađen.

source: A state with the name `{user_input_variable_do_not_translate}` was not found.
de_de: Ein Staat mit dem Namen '{user_input_variable_do_not_translate}' wurde nicht gefunden.
hr_hr: Država s imenom '{user_input_variable_do_not_translate}' nije pronađen.

source: A codec with the name `{user_input_variable_do_not_translate}` was not found.
de_de: Ein Codec mit dem Namen '{user_input_variable_do_not_translate}' wurde nicht gefunden.
hr_hr: Kodek s nazivom '{user_input_variable_do_not_translate}' nije pronađen.

source: A country code with the value `{user_input_variable_do_not_translate}` was not found.
de_de: Ein LÃ¤ndercode mit dem Wert '{user_input_variable_do_not_translate}' wurde nicht gefunden.
hr_hr: Šifra države s vrijednošću '{user_input_variable_do_not_translate}' nije pronađen.

source: A country with the name `{user_input_variable_do_not_translate}` was not found.
de_de: Ein Land mit dem Namen '{user_input_variable_do_not_translate}' wurde nicht gefunden.
hr_hr: Zemlja s imenom '{user_input_variable_do_not_translate}' nije pronađen.
