Repository: pypi-data/pypi-mirror-284
Catalog: packages/Py-Lav/py_lav-1.15.14.tar.gz/py_lav-1.15.14/pylav/extension/red/utils/locales/*.po
Languages: th_th

source: Shows the credits and translation details for the PyLav cogs and shared code
th_th: แสดงเครดิตและรายละเอียดการแปลสําหรับฟันเฟือง PyLav และรหัสที่ใช้ร่วมกัน

source: PyLav was created by {library_author_name_variable_do_not_translate}. PyLav source code can be located in {library_url_variable_do_not_translate} PyLav license can be located in {library_license_variable_do_not_translate} PyLav-Cogs source code can be located in {second_library_url_variable_do_not_translate} You can join the PyLav support server via {support_server_url_variable_do_not_translate} You can help translate PyLav by contributing to our Crowdin project at: {crowdin_project_url_variable_do_not_translate} Contributors: - {project_contributors_url_variable_do_not_translate} - {second_project_contributors_url_variable_do_not_translate} If you wish to buy me a coffee for my work, you can do so at: {buymeacoffee_url_variable_do_not_translate} or {github_sponsors_url_variable_do_not_translate}
th_th: ไพลาฟ ถูกสร้างขึ้นโดย {library_author_name_variable_do_not_translate}. โค้ดของ PyLav สามารถตามได้ที่ {library_url_variable_do_not_translate} ใบอนุญาต PyLav สามารถตามได้ที่ {library_license_variable_do_not_translate} โค้ดของ PyLav-Cogs สามารถตามได้ที่ {second_library_url_variable_do_not_translate} คุณสามารถเข้าร่วมเซิร์ฟเวอร์สนับสนุน PyLav ผ่านที่ {support_server_url_variable_do_not_translate} คุณสามารถช่วยแปล PyLav โดยการมีส่วนร่วมในโครงการ Crowdin ของเราที่: {crowdin_project_url_variable_do_not_translate} ผู้มีส่วนร่วม: - {project_contributors_url_variable_do_not_translate} - {second_project_contributors_url_variable_do_not_translate} หากคุณต้องการซื้อกาแฟให้กับงานของฉัน คุณสามารถทำได้ที่: {buymeacoffee_url_variable_do_not_translate} หรือ {github_sponsors_url_variable_do_not_translate}

source: Show the version of PyLav library
th_th: แสดงเวอร์ชันของห้องสมุด PyLav

source: Library
th_th: ห้องสมุด

source: Version
th_th: เวอร์ชัน

source: This command requires that I be in a voice channel before it can be executed.
th_th: คําสั่งนี้ต้องการให้ฉันอยู่ในช่องเสียงก่อนที่จะสามารถดําเนินการได้

source: PyLavPlayer cog is temporarily unavailable due to an outage with the backend services; please try again later.
th_th: ฟันเฟือง PyLavPlayer ไม่สามารถใช้งานได้ชั่วคราวเนื่องจากบริการแบ็กเอนด์ขัดข้อง โปรดลองอีกครั้งในภายหลัง

source: There are no nodes available currently.
th_th: ไม่มีโหนดที่พร้อมใช้งานในขณะนี้

source: PyLavPlayer is currently unable to process tracks belonging to {feature_name_variable_do_not_translate}.
th_th: ขณะนี้ PyLavPlayer ไม่สามารถประมวลผลแทร็กที่เป็นของ {feature_name_variable_do_not_translate}.

source: There is currently no available Lavalink node with the feature {feature_name_variable_do_not_translate}.
th_th: ขณะนี้ยังไม่มีโหนด Lavalink ที่พร้อมใช้งานพร้อมคุณสมบัตินี้ {feature_name_variable_do_not_translate}.

source: This command is unavailable in this channel; please use {channel_name_variable_do_not_translate} instead.
th_th: คําสั่งนี้ไม่พร้อมใช้งานในแชนเนลนี้ กรุณาใช้ {channel_name_variable_do_not_translate} แทน

source: This command requires you to be a disc jockey.
th_th: คําสั่งนี้กําหนดให้คุณต้องเป็นดิสก์จ๊อกกี้

source: PyLav is starting up; please try again in a few minutes.
th_th: PyLav กําลังเริ่มต้นขึ้น โปรดลองอีกครั้งในอีก 2-3 นาที
