from os.path import exists  
from os import walk

def файл_существует(путь_к_файлу):
    if exists(путь_к_файлу):
        return True
    return False

def записать_в_файл(путь_к_файлу, текст):
    путь_к_файлу = путь_к_файлу.replace("\\", "/")
    with open(путь_к_файлу,"w", encoding="utf-8") as файл:
        файл.write(текст)

def считать_из_файла(путь_к_файлу):
    путь_к_файлу = путь_к_файлу.replace("\\", "/")
    if not файл_существует(путь_к_файлу):
        return None
    with open(путь_к_файлу,"r", encoding="utf-8") as файл:
        return файл.read()
    
def список_папок(путь):
    предварительный_список = list(walk(путь))
    if предварительный_список == []:
        return []
    папки = предварительный_список[0][1]
    папки_с_путём = []
    for папка in папки:
        папки_с_путём.append(путь + "\\" + папка)
    return папки_с_путём

def список_файлов(путь,подпапки=False):
    class Файл:
        def __init__(self, файл, папка) -> None:
            self.полный_путь = папка + "\\" + файл
            self.полное_имя = файл
            self.имя = файл.rsplit (".", 1)[0]
            self.расширение = файл.rsplit(".", 1)[1]
            self.папка_имя = папка.rsplit("\\")[-1]
            self.папка_путь= папка + "\\"


    предварительный_список = list(walk(путь))
    if предварительный_список == []:
        return []
    
    if подпапки == True:
        общий_список = предварительный_список
    else:
        общий_список = [предварительный_список[0]]

    файлы_в_классах = []
    for список in общий_список:
        файлы = список[2]
        корневая_папка = список[0]
        for файл in файлы:
            файлы_в_классах.append(Файл(файл, корневая_папка))
    return файлы_в_классах

def сохранить_словари_в_тексте(словари, путь):
    результат = ""
    for словарь in словари:
        for пара in словарь.items():
            ключ, значение = пара
            ответ =  f"___+___{ключ}___:___{значение}"
            результат += ответ
        результат  += "\n"
    записать_в_файл(путь, результат)



def считать_словари_из_текста(путь):
    if not файл_существует(путь):
        return []
    результат = []
    текст = считать_из_файла(путь)
    строки = текст.splitlines()
    for строка in строки:
        новый_словарь = {}
        пары = строка.split("___+___")
        for пара in пары:
            if пара == "":
                continue
            ключ,значение = пара.split("___:___")
            новый_словарь[ключ] = значение
        результат.append(новый_словарь)
    return результат
        



if __name__=="__main__":
    тестовый_список = [{"ключ 1-1": "значение 1", "ключ 1-2": "значение 2"}, {"ключ 2-1": "значение 1", "ключ 2-2": "значение 2"}]
    сохранить_словари_в_тексте(тестовый_список, r"C:\Users\Максимов Алексей\Desktop\Ученики\Максимов\tools\статистика.txt")
    список_из_файла = считать_словари_из_текста(r"C:\Users\Максимов Алексей\Desktop\Ученики\Максимов\tools\статистика.txt")
    print(тестовый_список == список_из_файла)