def печать(текст, стиль="", цвет_красный=False, цвет_синий=False, цвет_зелёный=False, цвет_жёлтый=False, цвет_оранжевый=False):
    if цвет_красный:
        цвет = "255;0;0"
    elif цвет_синий:
        цвет = "0;0;255"
    elif цвет_зелёный:
        цвет = "0;255;0"
    elif цвет_жёлтый:
        цвет = "255;255;0"
    elif цвет_оранжевый:
        цвет = "255;155;0"
    else:
        цвет = "255;255;255"

    стили = {
        "ж": ";1", # жирный
        "т": ";2", # тонкий
        "к": ";3", # курсивый
        "ч": ";4", # подчёркнутый
        "з": ";9", # зачёркнутый
    }

    def определить_стиль(стиль):
        ответ = ""
        for буква in стиль:
            if буква in стили.keys():
                ответ += стили.get(буква)    
        return ответ
    
        
    
    новый_стиль = определить_стиль(стиль)
     
    print(f"\x1B[38;2;{цвет}{новый_стиль}m{текст}\x1B[0m")
    
if __name__=="__main__":
    # это условие срабатывает только тогда, когда файл запущен прямо отсюда. При импорте нне будет работать все то, что находится внутри IF
    печать("ТЕСТ", цвет_зелёный=True)