Repository: pypi-data/pypi-mirror-284
Catalog: packages/Py-Lav/py_lav-1.15.14-py3-none-any.whl/pylav/players/locales/*.po
Languages: id_id

source: There are no nodes available currently.
id_id: Tidak ada node yang tersedia saat ini.

source: Music in {number_of_servers_variable_do_not_translate} servers
id_id: Musik dalam {number_of_servers_variable_do_not_translate} Server

source: There are no tracks currently in the player history.
id_id: Tidak ada trek saat ini dalam sejarah pemain.

source: Current node has the volume filter feature disabled.
id_id: Node saat ini memiliki fitur filter volume yang dinonaktifkan.

source: Current node has the equalizer feature disabled.
id_id: Node saat ini memiliki fitur equalizer yang dinonaktifkan.

source: Current node has the karaoke feature disabled
id_id: Node saat ini memiliki fitur karaoke dinonaktifkan

source: Current node has the timescale feature disabled.
id_id: Node saat ini memiliki fitur skala waktu yang dinonaktifkan.

source: Current node has the tremolo feature disabled.
id_id: Node saat ini memiliki fitur tremolo dinonaktifkan.

source: Current node has the vibrato feature disabled.
id_id: Node saat ini memiliki fitur vibrato yang dinonaktifkan.

source: Current node has the rotation feature disabled.
id_id: Node saat ini memiliki fitur rotasi yang dinonaktifkan.

source: Current node has the distortion feature disabled.
id_id: Node saat ini memiliki fitur distorsi yang dinonaktifkan.

source: Current node has the low-pass feature disabled.
id_id: Node saat ini memiliki fitur low-pass yang dinonaktifkan.

source: Current node has the echo feature disabled.
id_id: Node saat ini memiliki fitur echo dinonaktifkan.

source: Current node has the reverb feature disabled.
id_id: Node saat ini memiliki fitur reverb dinonaktifkan.

source: Current node has the channel-mix feature disabled.
id_id: Node saat ini memiliki fitur channel-mix yang dinonaktifkan.

source: LIVE
id_id: HIDUP

source: Now Playing in {server_name_variable_do_not_translate}
id_id: Sekarang Bermain di {server_name_variable_do_not_translate}

source: Currently livestreaming
id_id: Saat ini livestreaming

source: Playing:
id_id: Bermain:

source: Requester
id_id: Pemohon

source: Duration: {track_duration_variable_do_not_translate}
id_id: Durasi: {track_duration_variable_do_not_translate}

source: Duration
id_id: Durasi

source: Previous Track
id_id: Lagu Sebelumnya

source: Next Track
id_id: Lagu Berikutnya

source: 1 track, {queue_total_duration_variable_do_not_translate} remaining
id_id: 1 lagu, {queue_total_duration_variable_do_not_translate} sisa

source: 0 tracks, {queue_total_duration_variable_do_not_translate} remaining
id_id: 0 lagu, {queue_total_duration_variable_do_not_translate} sisa

source: {track_count_variable_do_not_translate} tracks, {queue_total_duration_variable_do_not_translate} remaining
id_id: {track_count_variable_do_not_translate} Trek {queue_total_duration_variable_do_not_translate} sisa

source: Repeating
id_id: Mengulangi

source: Auto Play
id_id: Putar Otomatis

source: Effects
id_id: Efek

source: Volume
id_id: Jilid

source: You can search specific services by using the following prefixes: {deezer_service_variable_do_not_translate} - Deezer {spotify_service_variable_do_not_translate} - Spotify {apple_music_service_variable_do_not_translate} - Apple Music {youtube_music_service_variable_do_not_translate} - YouTube Music {youtube_service_variable_do_not_translate} - YouTube {soundcloud_service_variable_do_not_translate} - SoundCloud {yandex_music_service_variable_do_not_translate} - Yandex Music Example: {example_variable_do_not_translate}. If no prefix is used I will default to {fallback_service_variable_do_not_translate}
id_id: Anda dapat mencari layanan tertentu dengan menggunakan awalan berikut: {deezer_service_variable_do_not_translate} - Deezer {spotify_service_variable_do_not_translate} - Spotify {apple_music_service_variable_do_not_translate} - Apple Music {youtube_music_service_variable_do_not_translate} - YouTube Musik {youtube_service_variable_do_not_translate} - YouTube {soundcloud_service_variable_do_not_translate} - SoundCloud {yandex_music_service_variable_do_not_translate} - Musik Yandex Contoh: {example_variable_do_not_translate}. Jika tidak ada awalan yang digunakan, saya akan default ke {fallback_service_variable_do_not_translate}

source: Recently Played for {server_name_variable_do_not_translate}
id_id: Baru-baru ini dimainkan untuk {server_name_variable_do_not_translate}

source: Queue for {server_name_variable_do_not_translate}
id_id: Antrian untuk {server_name_variable_do_not_translate}

source: Playing
id_id: Bermain

source: Queue order will change every time a track is added due to auto shuffle being enabled.
id_id: Urutan antrean akan berubah setiap kali trek ditambahkan karena pengocokan otomatis diaktifkan.

source: Page 1 / 1 | 1 track, {queue_total_duration_variable_do_not_translate} remaining
id_id: Halaman 1 / 1 | 1 lagu, {queue_total_duration_variable_do_not_translate} sisa

source: Page 1 / 1 | 0 tracks, {queue_total_duration_variable_do_not_translate} remaining
id_id: Halaman 1 / 1 | 0 lagu, {queue_total_duration_variable_do_not_translate} sisa

source: Page {current_page_variable_do_not_translate} / {total_pages_variable_do_not_translate} | {track_number_variable_do_not_translate} tracks, {queue_total_duration_variable_do_not_translate} remaining
id_id: Halaman {current_page_variable_do_not_translate} / {total_pages_variable_do_not_translate} | {track_number_variable_do_not_translate} Trek {queue_total_duration_variable_do_not_translate} sisa
