Repository: pypi-data/pypi-mirror-284
Catalog: packages/Py-Lav/py_lav-1.15.14.tar.gz/py_lav-1.15.14/pylav/extension/red/ui/menus/locales/*.po
Languages: ro_ro

source: You are not authorized to interact with this.
ro_ro: Nu sunteți autorizat să interacționați cu acest lucru.

source: Enter the domain or IP address of the host.
ro_ro: Introduceți domeniul sau adresa IP a gazdei.

source: Host
ro_ro: Gazdă

source: Enter the host port to connect to.
ro_ro: Introduceți portul gazdă la care să vă conectați.

source: Port
ro_ro: Portul

source: Enter the node password.
ro_ro: Introduceți parola nodului.

source: Password
ro_ro: Parolă

source: Enter an easy to reference name for the node.
ro_ro: Introduceți un nume ușor de menționat pentru nod.

source: Name
ro_ro: Nume

source: Enter a timeout in seconds.
ro_ro: Introduceți o expirare în câteva secunde.

source: Timeout
ro_ro: Expirare

source: Sources to turn off.
ro_ro: Surse pentru a dezactiva.

source: The node name has been set to `{node_name_variable_do_not_translate}`.
ro_ro: Numele nodului a fost setat la '{node_name_variable_do_not_translate}`.

source: The node password has been set to `{node_password_variable_do_not_translate}`.
ro_ro: Parola nodului a fost setată la '{node_password_variable_do_not_translate}`.

source: The node host address has been set to `{node_host_variable_do_not_translate}`.
ro_ro: Adresa gazdă nod a fost setată la '{node_host_variable_do_not_translate}`.

source: The port you specified is invalid.
ro_ro: Portul pe care l-ați specificat nu este valid.

source: The node port has been set to `{node_port_variable_do_not_translate}`.
ro_ro: Portul nodului a fost setat la '{node_port_variable_do_not_translate}`.

source: The timeout you specified is invalid; it must be a number in seconds.
ro_ro: Expirarea pe care ați specificat-o nu este validă; trebuie să fie un număr în câteva secunde.

source: The node timeout has been set to `0` seconds.
ro_ro: Expirarea nodului a fost setată la "0" secunde.

source: The node timeout has been set to `1` second.
ro_ro: Expirarea nodului a fost setată la "1" secundă.

source: The node timeout has been set to `{node_timeout_variable_do_not_translate}` seconds.
ro_ro: Expirarea nodului a fost setată la '{node_timeout_variable_do_not_translate}' secunde.

source: Change the domain or IP address of the host.
ro_ro: Modificați domeniul sau adresa IP a gazdei.

source: Change the host port to connect to.
ro_ro: Modificați portul gazdă la care să vă conectați.

source: Change the node password.
ro_ro: Modificați parola nodului.

source: Change the name of this node.
ro_ro: Modificați numele acestui nod.

source: Enter the new timeout for this node.
ro_ro: Introduceți noul timeout pentru acest nod.

source: Source to disable.
ro_ro: Sursă pentru a dezactiva.

source: selected
ro_ro: selectat

source: inactive
ro_ro: inactiv

source: all
ro_ro: toate

source: I am not in any voice channel currently.
ro_ro: Eu nu sunt în orice canal de voce în prezent.

source: Please enter the playlist URL.
ro_ro: Vă rugăm să introduceți adresa URL a playlistului.

source: Playlist URL
ro_ro: URL Playlist

source: Please enter the playlist name.
ro_ro: Vă rugăm să introduceți numele playlist-ului.

source: Playlist Name
ro_ro: Nume Playlist

source: Please enter the new URL for this playlist.
ro_ro: Vă rugăm să introduceți noua adresă URL pentru această listă de redare.

source: Please enter the new name for this playlist.
ro_ro: Vă rugăm să introduceți noul nume pentru această listă de redare.

source: What is the query to add to this playlist?
ro_ro: Care este interogarea de adăugat la această listă de redare?

source: Query
ro_ro: Interogare

source: What is the query to remove from this playlist?
ro_ro: Care este interogarea de eliminat din această listă de redare?

source: Select a track to remove.
ro_ro: Selectați o pistă de eliminat.

source: Select a track to play now.
ro_ro: Selectați o piesă pe care să o redați acum.
