def 模块_更新内容查看():
    分隔符 = "-" * 100
    更新内容 = f"""
{分隔符}
版本号：1.0.172 ---- 2024年7月12日
新增命令：mysql_克隆表单_仅结构(连接对象,源表名,目标表名，#自动递增是否归重置>布尔型，可空<) -->返回一个布尔型：成功返回True，失败返回 False
新增命令：mysql_克隆表单_结构和数据(连接对象,源表名,目标表名)   -->返回一个布尔型：成功返回True，失败返回 False
新增命令：mysql_更新_字段名(连接对象,表名,新字段名列表)   -->返回一个布尔型：成功返回True，失败返回 False
新增命令：mysql_查询_表结构(连接对象,表名)  -->返回一个列表用于存储：结构信息，失败则返回空列表
新增命令：mysql_创建新表(连接对象,表名,结构信息)   -->返回一个布尔型：成功返回True，失败返回 False
{分隔符}
版本号：1.0.173 ---- 2024年7月12日
新增命令：模块_更新内容查看()    -->无需传递任何参数且没有返回值，默认打印每个版本更新的内容详情
{分隔符}
版本号：1.0.174 ---- 2024年7月13日
修复已知BUG
{分隔符}
版本号：1.0.175 ---- 2024年7月13日
修复命令：mysql_更新_字段名(连接对象,表名,新字段名列表)  字符集问题导致无法正常修改的情况
{分隔符}
版本号：1.0.176 ---- 2024年7月14日
新增命令：邮件IMAP_按日期和发件人搜索邮件(连接对象, 年(int), 月(int), 日(int), 发件人邮箱(str), 条件="SINCE")    -->最后的条件"SINCE"表示条件日期之后的，"BEFORE"表示取之前的
新增命令：邮件IMAP_按日期和主题搜索邮件(连接对象, 年(int), 月(int), 日(int), 主题(str), 条件="SINCE")    -->最后的条件"SINCE"表示条件日期之后的，"BEFORE"表示取之前的
{分隔符}
版本号：1.0.184 ---- 2024年7月15日
对模块内部板块进行调整，增加独立调用特性，优化执行效率。
可对每个板块的功能进行独立调用。

使用示例：
import zfx.网页协议 as 协议
响应对象 = 协议.网页协议_发送_GET请求("www.baidu.com")
print(响应对象)
{分隔符}
版本号：1.0.185 ---- 2024年7月15日
新增命令：
    进程_取命令行(pid)
    进程_取父ID(pid)
    进程_取程序路径(pid)
    进程_取线程数(pid)
    进程_取进程列表()
    进程_取进程启动时间(pid)
    进程_名取ID(进程名)
    进程_名取ID列表(进程名)
    进程_枚举()
    进程_结束PID(pid)
    进程_结束名(进程名)
{分隔符}
"""
    print(更新内容)