Repository: pypi-data/pypi-mirror-284
Catalog: packages/Py-Lav/py_lav-1.15.14-py3-none-any.whl/pylav/extension/red/utils/locales/*.po
Languages: hu_hu, tr_tr

source: Shows the credits and translation details for the PyLav cogs and shared code
hu_hu: Megjeleníti a PyLav-fogaskerekek és a megosztott kód kreditjeit és fordítási részleteit
tr_tr: PyLav çarkları ve paylaşılan kod için kredileri ve çeviri ayrıntılarını gösterir

source: PyLav was created by {library_author_name_variable_do_not_translate}. PyLav source code can be located in {library_url_variable_do_not_translate} PyLav license can be located in {library_license_variable_do_not_translate} PyLav-Cogs source code can be located in {second_library_url_variable_do_not_translate} You can join the PyLav support server via {support_server_url_variable_do_not_translate} You can help translate PyLav by contributing to our Crowdin project at: {crowdin_project_url_variable_do_not_translate} Contributors: - {project_contributors_url_variable_do_not_translate} - {second_project_contributors_url_variable_do_not_translate} If you wish to buy me a coffee for my work, you can do so at: {buymeacoffee_url_variable_do_not_translate} or {github_sponsors_url_variable_do_not_translate}
hu_hu: PyLav {library_author_name_variable_do_not_translate} által lett létrehozva. PyLav forráskódja megtalálható itt: {library_url_variable_do_not_translate} PyLav licencét itt találhatod: {library_license_variable_do_not_translate} PyLav-Cogs forráskódja megtalálható itt: {second_library_url_variable_do_not_translate} Csatlakozhatsz a PyLav támogatói szerveréhez itt: {support_server_url_variable_do_not_translate} Segíthetsz a PyLav fordításában a Crowdin projektünkön keresztül: {crowdin_project_url_variable_do_not_translate} Közreműködők: - {project_contributors_url_variable_do_not_translate} - {second_project_contributors_url_variable_do_not_translate} Ha szeretnél venni nekem egy kávét a munkámért, megteheted itt: {buymeacoffee_url_variable_do_not_translate} vagy itt: {github_sponsors_url_variable_do_not_translate}
tr_tr: Arjantin {library_author_name_variable_do_not_translate} tarafından oluşturuldu. PyLav kaynak kodu şurada bulunabilir: {library_url_variable_do_not_translate} PyLav lisansı şurada bulunabilir: {library_license_variable_do_not_translate} PyLav-Cogs kaynak kodu şurada bulunabilir: {second_library_url_variable_do_not_translate} PyLav destek sunucusuna şu bağlantı üzerinden katılabilirsiniz: {support_server_url_variable_do_not_translate} PyLav'ı çevirerek yardımcı olabilirsiniz, Crowdin projemize katkıda bulunarak: {crowdin_project_url_variable_do_not_translate} Katkıda bulunanlar: - {project_contributors_url_variable_do_not_translate} - {second_project_contributors_url_variable_do_not_translate} Eserime kahve almak isterseniz, şuradan yapabilirsiniz: {buymeacoffee_url_variable_do_not_translate} veya {github_sponsors_url_variable_do_not_translate}

source: Show the version of PyLav library
hu_hu: A PyLav-kódtár verziójának megjelenítése
tr_tr: PyLav kitaplığının sürümünü gösterme

source: Library
hu_hu: Könyvtár
tr_tr: Kütüphane

source: Version
hu_hu: Verzió
tr_tr: Sürüm

source: This command requires that I be in a voice channel before it can be executed.
hu_hu: Ez a parancs megköveteli, hogy hangcsatornában legyek, mielőtt végrehajtható lenne.
tr_tr: Bu komut, yürütülmeden önce bir ses kanalında olmamı gerektiriyor.

source: PyLavPlayer cog is temporarily unavailable due to an outage with the backend services; please try again later.
hu_hu: A PyLavPlayer fogaskereke ideiglenesen nem érhető el a háttérszolgáltatások leállása miatt; Kérjük, próbálja újra később.
tr_tr: PyLavPlayer dişlisi, arka uç hizmetlerindeki bir kesinti nedeniyle geçici olarak kullanılamıyor; lütfen daha sonra tekrar deneyin.

source: There are no nodes available currently.
hu_hu: Jelenleg nincsenek elérhető csomópontok.
tr_tr: Şu anda kullanılabilir düğüm yok.

source: PyLavPlayer is currently unable to process tracks belonging to {feature_name_variable_do_not_translate}.
hu_hu: A PyLavPlayer jelenleg nem tudja feldolgozni a {feature_name_variable_do_not_translate}.
tr_tr: PyLavPlayer şu anda {feature_name_variable_do_not_translate}.

source: There is currently no available Lavalink node with the feature {feature_name_variable_do_not_translate}.
hu_hu: Jelenleg nincs elérhető Lavalink csomópont a funkcióval {feature_name_variable_do_not_translate}.
tr_tr: Şu anda bu özelliğe sahip kullanılabilir bir Lavalink düğümü yoktur {feature_name_variable_do_not_translate}.

source: This command is unavailable in this channel; please use {channel_name_variable_do_not_translate} instead.
hu_hu: Ez a parancs nem érhető el ebben a csatornában; Kérjük, használja {channel_name_variable_do_not_translate} helyette.
tr_tr: Bu komut bu kanalda kullanılamaz; lütfen kullanın {channel_name_variable_do_not_translate} yerine.

source: This command requires you to be a disc jockey.
hu_hu: Ez a parancs megköveteli, hogy lemezlovas legyél.
tr_tr: Bu komut bir disk jokey olmanızı gerektirir.

source: PyLav is starting up; please try again in a few minutes.
hu_hu: A PyLav elindul; Kérjük, próbálja újra néhány perc múlva.
tr_tr: PyLav başlıyor; lütfen birkaç dakika içinde tekrar deneyin.
